package com.company;

public class Main {

    public static void main(String[] args) {
	// на кладе завода имеется некоторое кол-во деталей. Детали различаются материалом(сталь, железо, медь, дерево, алюминий и т.д)
        //назначением (комплектующего или инструменты), весом и стоимостью. Все детали пронумерованы. Удалить детали с заданными номерами,если
        //если вес детали превышает некотрую константу.Использовать коллекции типа HashMap.
        //Обеспечить возможность перебора всех деталейнажатием одной кнопки с целью печати инф-ии о детали(вывлд на консоль)
        //доб-ть в коллекцию новую деталь и сформировать новую кнопку для нее
    }
}
